exports.shorthands = undefined;

exports.up = (pgm) => {
    pgm.createTable("programmes", {
        id: "id",
        pid: {
            type: "integer",
            notNull: false,
            default: null
        },
        code: {
            type: "varchar(255)", 
            notNull: true
        },
        titleEn: { 
            type: "varchar(255)", 
            notNull: true
        },
        titleRu: { 
            type: "varchar(255)", 
            notNull: true
        }
    });

    pgm.sql("INSERT INTO public.programmes (\"id\", \"pid\", \"code\", \"titleEn\", \"titleRu\") VALUES "+
    "(1, NULL, '2390/A0/05/880', 'PROGRAMME EFFECTIVENESS OUTCOME', 'РЕЗУЛЬТАТЫ ЭФФЕКТИВНОСТИ ПРОГРАММЫ'),"+
    "(2, 1, '2390/A0/05/880/001', 'PROGRAMME COORDINATION', 'КООРДИНАЦИЯ ПРОГРАММЫ'),"+
    "(3, 2, '2390/A0/05/880/001/001','DEPUTY REPRESENTATIVE/COORDINATION','ЗАМЕСТИТЕЛЬ ПРЕДСТАВИТЕЛЯ/КООРДИНАЦИЯ'),"+
    "(4, 2, '2390/A0/05/880/001/002','TRAVEL','ПОЕЗДКИ'),"+
    "(5, 2, '2390/A0/05/880/001/003','PROGRAMME REVIEW','ОБЗОР ПРОГРАММЫ'),"+
    "(6, 1, '2390/A0/05/880/002','EXTERNAL RELATIONS','ВНЕШНИЕ СВЯЗИ'),"+
    "(7, 6, '2390/A0/05/880/002/001','COMMUNICATION/ EXTERNAL RELATIONS','КОММУНИКАЦИИ/ВНЕШНИЕ СВЯЗИ'),"+
    "(8, 6, '2390/A0/05/880/002/002','TRAVEL','ПОЕЗДКИ'),"+
    "(9, 1, '2390/A0/05/880/003','CROSS SECTORAL AND OPERATIONS SUPPORT','МЕЖСЕКТОРАЛЬНАЯ И ОПЕРАЦИОННАЯ ПОДДЕРЖКА'),"+
    "(10, 9, '2390/A0/05/880/003/001','CROSS SECTORAL APPROACH COSTS','ЗАТРАТЫ НА МЕЖСЕКТОРАЛЬНЫЙ ПОДХОД'),"+
    "(11, NULL, '2390/A0/05/881','EQUITY AND INCLUSION','РАВЕНСТВО И ИНКЛЮЗИЯ'),"+
    "(12, 11, '2390/A0/05/881/001','EFFECTIVE SOCIAL ASSISTANCE','ЭФФЕКТИВНАЯ СОЦИАЛЬНАЯ ПОМОЩЬ'),"+
    "(13, 12, '2390/A0/05/881/001/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(14, 12, '2390/A0/05/881/001/002','INTRO SOCIAL MODEL OF DISABILITY','ВВЕДЕНИЕ СОЦИАЛЬНОЙ МОДЕЛИ ИНВАЛИДНОСТИ'),"+
    "(15, 12, '2390/A0/05/881/001/003','IMPROVED EFFECTIVENESS OF TSA','ПОВЫШЕНИЕ ЭФФЕКТИВНОСТИ АСП'),"+
    "(16, 12, '2390/A0/05/881/001/004','REVISION OF SUBSISTENCE MINIMUM','ПЕРЕСМОТР ПРОЖИТОЧНОГО МИНИМУМА'),"+
    "(17, 12, '2390/A0/05/881/001/005','STRENGTHENING NGO SECTOR','УСИЛЕНИЕ СЕКТОРА НПО'),"+
    "(18, 12, '2390/A0/05/881/001/006','CHILD POVERTY','ДЕТСКАЯ БЕДНОСТЬ'),"+
    "(19, 12, '2390/A0/05/881/001/007','EVALUATION','ОЦЕНКА'),"+
    "(20, 11, '2390/A0/05/881/002','IMPROVED SOCIAL SECTOR COHESION','ПОВЫШЕНИЕ СПЛОЧЕННОСТИ СОЦИАЛЬНОГО СЕКТОРА'),"+
    "(21, 20, '2390/A0/05/881/002/001',' PROGRAMME REVIEW','ОБЗОР ПРОГРАММЫ'),"+
    "(22, 20, '2390/A0/05/881/002/002','COHESIVE SOCIAL SERVICES','ОБЪЕДИНЕННЫЕ СОЦИАЛЬНЫЕ СЛУЖБЫ'),"+
    "(23, 20, '2390/A0/05/881/002/003','UNIFIED REFERRAL ALGORITHMS','УНИФИЦИРОВАННЫЕ АЛГОРИТМ ПЕРЕНАПРАВЛЕНИЯ'),"+
    "(24, 11, '2390/A0/05/881/003','COMPREHENSIVE HOME VISITING SERVICE','КОМПЛЕКСНАЯ ПАТРОНАЖНАЯ СИСТЕМА'),"+
    "(25, 24, '2390/A0/05/881/003/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(26, 24, '2390/A0/05/881/003/002','PILOT UP-PNS','ПИЛОТ ПАТРОНАЖНОЙ СИСТЕМЫ'),"+
    "(27, 24, '2390/A0/05/881/003/003','ECD/C4D','РДР/КвЦР'),"+
    "(28, 24, '2390/A0/05/881/003/004','MICRONUTRIENT STATUS','СТАТУС МИКРОНУТРИЕНТА'),"+
    "(29, 24, '2390/A0/05/881/003/005','EVALUATION OF ECD & ECE SYSTEMS','ОЦЕНКА СИСТЕМ РДР И РДО'),"+
    "(30, 24, '2390/A0/05/881/003/006','UP-PNS MODEL SCALE UP PREPARATION','ПОДГОТОВКА ПАТРОНАЖНОЙ МОДЕЛИ К МАШТАБИРОВАНИЮ'),"+
    "(31, 24, '2390/A0/05/881/003/007','EVALUATION OF PNS','ОЦЕНКА КОМПЛЕКСНОЙ ПАТРОНАЖНОЙ СИСТЕМЫ'),"+
    "(32, 24, '2390/A0/05/881/003/008','IMPROVED MCH','УЛУЧШЕНИЕ ЗМиР'),"+
    "(33, 11, '2390/A0/05/881/004','QUALITY SOCIAL WORK','КАЧЕСТВЕННАЯ СОЦИАЛЬНАЯ РАБОТА'),"+
    "(34, 33, '2390/A0/05/881/004/001','EQUITY-FOCUSSED NORMATIVE FRAMEWORK','НОРМАТИВНАЯ БАЗА С ОРИЕНТИРОМ НА РАВЕНСТВО'),"+
    "(35, 33, '2390/A0/05/881/004/002','SUPERVISION & QA FRAMEWORK FOR SW','РУКОВОДСТВО & ПРАВИЛА ОБЕСПЕЧЕНИЯ КАЧЕСТВА СР'),"+
    "(36, 33, '2390/A0/05/881/004/003','EQ-BASED CROSS-SECTOR MODEL FOR SW','МЕЖСЕКТОРАЛЬНАЯ МОДЕЛЬ СР НА ОСНОВЕ ЭК'),"+
    "(37, 11, '2390/A0/05/881/005','VULNERABLE ADOLESCENTS','УЯЗВИМЫЕ ПОДРОСТКИ'),"+
    "(38, 37, '2390/A0/05/881/005/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(39, 37, '2390/A0/05/881/005/002','NATIONAL ADOLESCENT SP PROGRAMMES','НАЦИОНАЛЬНЫЕ ПРОГРАММЫ БОРЬБЫ С ПОДРОСТКОВЫМ СУИЦИДОМ'),"+
    "(40, 37, '2390/A0/05/881/005/003','PILOT: SUICIDE PREVENTION PROG IN KO','ПИЛОТ: ПРОГ ПРЕДОТВРАЩЕНИЯ СУИЦИДОВ В КО'),"+
    "(41, 37, '2390/A0/05/881/005/004','PILOT:SUICIDE PREVENTION PROG IN MO','ПИЛОТ: ПРОГ ПРЕДОТВРАЩЕНИЯ СУИЦИДОВ В МО'),"+
    "(42, 37, '2390/A0/05/881/005/005','PILOT: YRCS IN KO AND MO','ПИЛОТ: МОЛОДЕЖНЫЕ РЕСУРСНЫЕ ЦЕНТРЫ В МО И КО'),"+
    "(43, 37, '2390/A0/05/881/005/006','YRC MODEL IN NATL PLAN','МОДЕЛЬ МОЛОДЕЖНОГО РЕСУРСНОГО ЦЕНТРА В НАЦ ПЛАНЕ'),"+
    "(44, 11, '2390/A0/05/881/006','RESILIENCE - RISK & VULNERABILITY','УСТОЙЧИВОСТЬ - РИСК & УЯЗВИМОСТЬ'),"+
    "(45, 44, '2390/A0/05/881/006/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(46, 44, '2390/A0/05/881/006/002','STRENGTHENING DRA METHODOLOGY','УЛУЧШЕНИЕ МЕТОДОЛОГИИ РСБ'),"+
    "(47, 44, '2390/A0/05/881/006/003','COSTING DRA & SCALE UP PREPARATION','СТОИМОСТЬ РСБ & МАСШТАБИРОВАНИЕ ПОДГОТОВКИ'),"+
    "(48, 44, '2390/A0/05/881/006/004','ADAPTING DRA FOR CROSS-SECTOR USE','АДАПТАЦИЯ РСБ ДЛЯ МЕЖСЕКТОРАЛЬНОГО ИСПОЛЬЗОВАНИЯ'),"+
    "(49, 44, '2390/A0/05/881/006/005','CHILD-FRIENDLY DR INSURANCE SYSTEM','СИСТЕМА СТРАХОВАНИЯ ОТ СБ ДЛЯ ДЕТЕЙ'),"+
    "(50, NULL, '2390/A0/05/882','CHILD-FRIENDLY SOCIAL ENVIRONMENT','БЛАГОПРИЯТНАЯ СОЦИАЛЬНАЯ СРЕДА ДЛЯ ДЕТЕЙ'),"+
    "(51, 50, '2390/A0/05/882/001','ELIMINATING VIOLENCE AGAINST CHILDREN','ПРЕДОТВРАЩЕНИЕ НАСИЛИЯ В ОТНОШЕНИИ ДЕТЕЙ'),"+
    "(52, 51, '2390/A0/05/882/001/001','PUBLIC AWARENESS ON VAC','ПОВЫШЕНИЕ ОСВЕДОМЛЕННОСТИ О ПНД'),"+
    "(53, 51, '2390/A0/05/882/001/002','GAPS CLSOED IN LEGAL NORMS','УСТРАНЕНИЕ ПРОБЕЛОВ В ПРАВОВЫХ НОРМАХ'),"+
    "(54, 50, '2390/A0/05/882/002','ALIGNING LAWS, POLICIES & PROTOCOLS','СОГЛАСОВАНИЕ ЗАКОНОВ, ПОЛИТИК & ПРОТОКОЛОВ'),"+
    "(55, 54, '2390/A0/05/882/002/001','CHILD-FRIENDLY COURTS & FACILITIES','ДРУЖЕСТВЕННЫЕ ДЛЯ ДЕТЕЙ СУДЫ  И УЧРЕЖДЕНИЯ'),"+
    "(56, 54, '2390/A0/05/882/002/002','VAC METHODOLOGY IN CURRICULUM','МЕТОДОЛОГИЯ ПНД В УЧЕБНОМ ПЛАНЕ'),"+
    "(57, 54, '2390/A0/05/882/002/003','SCALE-UP OF VAC METHODOLOGY','МАСШТАБИРОВАНИЕ МЕТОДОЛОГИИ ПНД'),"+
    "(58, 54, '2390/A0/05/882/002/004','ALIGNMENT OF LEGISLATION, POLICY ETC','СОГЛАСОВАНИЕ ЗАКОНОВ, ПОЛИТИК & ПРОТОКОЛОВ'),"+
    "(59, 54, '2390/A0/05/882/002/005','SOPS & GUIDELINES ON CVWC','СПД & УКАЗАНИЯ К ДЖиСП'),"+
    "(60, 50, '2390/A0/05/882/003','TRANSFORMING RESIDENTIAL INSTITUTIONS','ТРАНСФОРМАЦИЯ ИНТЕРНАТНЫХ УЧРЕЖДЕНИЙ'),"+
    "(61, 60, '2390/A0/05/882/003/001','STAFF COSTS','ЗАТРАТЫ НА ПЕРСОНАЛ'),"+
    "(62, 60, '2390/A0/05/882/003/002','TRAVEL','ПОЕЗДКИ'),"+
    "(63, 60, '2390/A0/05/882/003/003','OBLAST TRANSFORMATION STRATEGY','СТРАТЕГИЯ ТРАНСФОРМАЦИИ ОБЛАСТИ'),"+
    "(64, 60, '2390/A0/05/882/003/004','ACCOMPANYING TRANSFORMATION','СОПРОВОЖДЕНИЕ ТРАНСФОРМАЦИИ'),"+
    "(65, 60, '2390/A0/05/882/003/005','ALIGN CHILD CARE LAW & POLICY','ПРИВЕДЕНИЕ В СООТВЕТСТВИЕ ЗАКОНОВ И ПОЛИТИКИ О ЗАБОТЕ О ДЕТЯХ'),"+
    "(66, 60, '2390/A0/05/882/003/006','ESTABLISHING FAMILY SUPPORT CENTRE','СОЗДАНИЕ ЦЕНТРА ПОДДЕРЖКИ СЕМЬИ'),"+
    "(67, 50, '2390/A0/05/882/004','DIVERSION, PROBATION AND REHABILITATION','ДИВЕРСИФИКАЦИЯ, ПРОБАЦИЯ И РЕАБИЛИТАЦИЯ'),"+
    "(68, 67, '2390/A0/05/882/004/001','STAFF COSTS','ЗАТРАТЫ НА ПЕРСОНАЛ'),"+
    "(69, 67, '2390/A0/05/882/004/002','CENTRAL AND LOCAL COORDINATION','ЦЕНТРАЛЬНАЯ И МЕСТНАЯ КОММУНИКАЦИЯ'),"+
    "(70, 67, '2390/A0/05/882/004/003','KAP ON VAC','ЗОП ДЛЯ ПНД'),"+
    "(71, 67, '2390/A0/05/882/004/004','IMPROVED PROTECTIVE ENVIRNMENT','УЛУЧШЕННАЯ  ЗАЩИЩАЮЩАЯ СРЕДА'),"+
    "(72, 67, '2390/A0/05/882/004/005','PILOT: ALTERNATIVES IN EKO, KO AND MO','ПИЛОТ: АЛЬТЕРНАТИВЫ В ВКО, КО, МО'),"+
    "(73, 67, '2390/A0/05/882/004/006','JJ & CR IN-SERVICE CURRICULA','ЮЮ & ЗПР В ПРОГРАММЕ ПОВЫШЕНИЯ КВАЛИФИКАЦИИ'),"+
    "(74, 67, '2390/A0/05/882/004/007','PROFESSIONALS APPY INTL STDS','СПЕЦИАЛИСТЫ ПРИМЕНЯЮТ МЕЖДУНАРОДНЫЕ СТАНДАРТЫ'),"+
    "(75, 67, '2390/A0/05/882/004/008','MENTAL HEALTH NEEDS OF ADOLESCENTS IN CONFLICT WITH THE LAW','ПСИХИЧЕСКОЕ ЗДОРОВЬЕ  ПОДРОСТКОВ В КОНФЛИКТЕ С ЗАКОНОМ'),"+
    "(76, 67, '2390/A0/05/882/004/009','EVALUATION AND COSTING OF JJ PROGS','ОЦЕНКА  И СТОИМОСТЬ ПРОГРАММЫ ЮЮ'),"+
    "(77, 50, '2390/A0/05/882/005','MONITORING QUALITY OF CARE & VAC','МОНИТОРИНГ КАЧЕСТВА УХОДА &ПНД'),"+
    "(78, 77, '2390/A0/05/882/005/001','MONITORING QUALITY OF CARE IN CLOSED INSTITUTIONS','МОНИТОРИНГ КАЧЕСТВА УХОДА В ЗАКРЫТЫХ УЧРЕЖДЕНИЯХ'),"+
    "(79, 77, '2390/A0/05/882/005/002','INDEPENDENT CRM BY HRIS & CSOS','НЕЗАВИСЕМЫЙ МОНИТОРИНГ ПРАВ РЕБЕНКА АСУП И НПО'),"+
    "(80, 77, '2390/A0/05/882/005/003','ADVOCACY FOR CR','ПРОДВИЖЕНИЕ ПР'),"+
    "(81, 50, '2390/A0/05/882/006','CHILD SAFETY AND REDUCED INJURIES','ДЕТСКАЯ БЕЗОПАСНОСТЬ И СОКРАЩЕНИЕ ТРАВМАТИЗМА'),"+
    "(82, 81, '2390/A0/05/882/006/001','AT-RISK CASES IDENTIFIED','ВЫЯВЛЕНИЕ СЛУЧАЕВ В ГРУППЕ РИСКА'),"+
    "(83, 81, '2390/A0/05/882/006/002','ALIGNING SSA WITH GLOBAL FRAMEWORK','СОГЛАСОВАНИЕ ССО С ГЛОБАЛЬНОЙ ПОВЕСТКОЙ'),"+
    "(84, 81, '2390/A0/05/882/006/003','EDU SYSTEM INCORPORATED DRR','ОБР СИСТЕМА ВКЛЮЧАЕТ СРБ'),"+
    "(85, 81, '2390/A0/05/882/006/004','INTERSECTORAL COOP ON INJURY PREV','МЕЖСЕКТОРАЛЬНОЕ СОТР ПО ПРЕДОТВР ТРАВМ'),"+
    "(86, 81, '2390/A0/05/882/006/005','PUBLIC AWARENESS, CHILD INJURY','ПОВЫШЕНИЕ ОСВЕДОМЛЕННОСТИ, ДЕТСКИЙ ТРАВМАТИЗМ'),"+
    "(87, 81, '2390/A0/05/882/006/006','LEGISLATION ALIGNED WITH INTL STDS','ЗАКОНОДАТЕЛЬСТВО СООТВЕТСТВУЕТ МЕЖДУНАРОДНЫМ СТАНДАРТАМ'),"+
    "(88, NULL, '2390/A0/05/883','INNOVATIVE PARTNERSHIPS','ИННОВАЦИОННЫЕ ПАРТНЕРСТВА'),"+
    "(89, 88, '2390/A0/05/883/001','BEYOND-BORDER KNOWLEDGE EXCHANGE','ОБМЕН ЗНАНИЯМИ ЗА ПРЕДЕЛАМИ СТРАНЫ'),"+
    "(90, 89, '2390/A0/05/883/001/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(91, 89, '2390/A0/05/883/001/002','TRAVEL','ПОЕЗДКИ'),"+
    "(92, 89, '2390/A0/05/883/001/003','LOCAL AREA COORDINATION','КООРДИНАЦИЯ НА МЕСТНОМ УРОВНЕ'),"+
    "(93, 88, '2390/A0/05/883/002','BEST INTERESTS OF THE CHILD & ODA','ЛУЧШИЕ ИНТЕРЕСЫ РЕБЕНКА & ОПР'),"+
    "(94, 88, '2390/A0/05/883/003','INTEGRATED CHILD RIGHTS MONITRORING','ИНТЕГРИРОВАННЫЙ МОНИТОРИНГ ПРАВ РЕБЕНКА'),"+
    "(95, 94, '2390/A0/05/883/003/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(96, 94, '2390/A0/05/883/003/002','CFCI IMPLEMENTATION','РЕАЛИЗАЦИЯ ГДР'),"+
    "(97, 94, '2390/A0/05/883/003/003','PILOT: CWMS IN KO','ПИЛОТ: СБР В КО'),"+
    "(98, 94, '2390/A0/05/883/003/004','DATA & KNOWLEDGE ON STATUS OF CR','ДАННЫЕ & ЗНАНИЕ О СОСТОЯНИИ ПР'),"+
    "(99, 94, '2390/A0/05/883/003/005','MODEL CWMS COSTED & EVALUATED','МОДЕЛЬ СБР ПРОСЧИТАНА И  ОЦЕНЕНА'),"+
    "(100, 94, '2390/A0/05/883/003/006','STATISTICAL YEARBOOK DEVELOPED','РАЗРАБОТКА СТАТИСТИЧЕСКОГО ГОДОВОГО ОТЧЕТА'),"+
    "(101, 94, '2390/A0/05/883/003/007','SITUATIONAL ANALYSIS','СИТУАТИВНЫЙ АНАЛИЗ'),"+
    "(102, 94, '2390/A0/05/883/003/008','U-REPORT','U-REPORT'),"+
    "(103, 94, '2390/A0/05/883/003/009','SDGS FOR CHILDREN','ЦСР ДЛЯ ДЕТЕЙ'),"+
    "(104, 88, '2390/A0/05/883/004','INNOVATIVE PARTNERSHIPS','ИННОВАЦИОННЫЕ ПАРТНЕРСТВА'),"+
    "(105, 104, '2390/A0/05/883/004/001','STAFF COSTS','ЗАТРАТЫ ПЕРСОНАЛА'),"+
    "(106, 104, '2390/A0/05/883/004/002','COMMUNICATION','КОММУНИКАЦИЯ'),"+
    "(107, 104, '2390/A0/05/883/004/003','NGO COALITION & WEB PORTAL','КОАЛИЦИЯ НПО & ВЕБ-ПОРТАЛ'),"+
    "(108, 104, '2390/A0/05/883/004/004','TECHNICAL ASSISTANCE - PARTNERSHIP','ТЕХНИЧЕСКАЯ ПОМОЩЬ - ПАРТНЕРСТВО'),"+
    "(109, 104, '2390/A0/05/883/004/005','EXPO-2017','ЭКСПО-2017')");
};

exports.down = (pgm) => {
    pgm.dropTable("programmes", {});
};
